# messages
msg.message=\u067E\u06CC\u063A\u0627\u0645:: 
msg.create-new-session-for-user=\u062F\u0633\u062A\u0631\u0633\u06CC \u06A9\u0627\u0631\u0628\u0631 \u0628\u0647 \u0627\u0632\u0627\u06CC \u0633\u0631\u0648\u06CC\u0633 \u0647\u0627\u06CC \u06A9\u0627\u0631\u062A \u0627\u06CC\u062C\u0627\u062F \u0634\u062F.
msg.process-successful=\u0639\u0645\u0644\u06CC\u0627\u062A \u0628\u0627 \u0645\u0648\u0641\u0642\u06CC\u062A \u0627\u0646\u062C\u0627\u0645 \u0634\u062F.
msg.transaction-log-persisted=\u0627\u0637\u0644\u0627\u0639\u0627\u062A \u062A\u0631\u0627\u06A9\u0646\u0634 \u0630\u062E\u06CC\u0631\u0647 \u0634\u062F.
# Errors
err.error=\u062E\u0637\u0627:: 
err.invalid-data-entry=\u0627\u0637\u0644\u0627\u0639\u0627\u062A \u0648\u0631\u0648\u062F\u06CC \u0645\u0639\u062A\u0628\u0631 \u0646\u0645\u06CC \u0628\u0627\u0634\u062F.
err.invalid-type=\u0646\u0648\u0639 \u0633\u0631\u0648\u06CC\u0633 \u0645\u0639\u062A\u0628\u0631 \u0646\u0645\u06CC \u0628\u0627\u0634\u062F.
err.not-authorized=\u0627\u0639\u062A\u0628\u0627\u0631\u0633\u0646\u062C\u06CC \u062F\u0631\u062E\u0648\u0627\u0633\u062A \u06A9\u0646\u0646\u062F\u0647 \u0633\u0631\u0648\u06CC\u0633 \u0647\u0627\u06CC \u06A9\u0627\u0631\u062A \u0627\u0646\u062C\u0627\u0645 \u0646\u0634\u062F.
err.user-must-granted-by-USER-role=\u0627\u06CC\u0646 \u06A9\u0627\u0631\u0628\u0631 \u0628\u0631\u0627\u06CC \u0627\u0633\u062A\u0641\u0627\u062F\u0647 \u0627\u0632 \u0633\u0631\u0648\u06CC\u0633 \u0647\u0627\u06CC \u06A9\u0627\u0631\u062A \u0645\u062C\u0627\u0632 \u0646\u0645\u06CC \u0628\u0627\u0634\u062F.
err.invalid-token=\u06A9\u0644\u06CC\u062F \u062F\u0633\u062A\u0631\u0633\u06CC \u0633\u0631\u0648\u06CC\u0633 \u0647\u0627\u06CC \u06A9\u0627\u0631\u062A \u0645\u0639\u062A\u0628\u0631 \u0646\u0645\u06CC \u0628\u0627\u0634\u062F.
err.session-is-null=\u0627\u0631\u062A\u0628\u0627\u0637 \u0628\u0627 \u0633\u0631\u0648\u06CC\u0633 \u0647\u0627\u06CC \u06A9\u0627\u0631\u062A \u062F\u0686\u0627\u0631 \u0627\u062E\u062A\u0644\u0627\u0644 \u0634\u062F\u0647 \u0627\u0633\u062A\u060C \u0644\u0637\u0641\u0627 \u0645\u062C\u062F\u062F \u062A\u0644\u0627\u0634 \u0646\u0645\u0627\u06CC\u06CC\u062F.
err.card-fail-response-set=\u0639\u0645\u0644\u06CC\u0627\u062A \u0634\u0627\u0631\u0698 \u06A9\u0627\u0631\u062A \u0628\u0627 \u0634\u06A9\u0633\u062A \u0645\u0648\u0627\u062C\u0647 \u0634\u062F.
err.payment-status-is-not-successful=\u0639\u0645\u0644\u06CC\u0627\u062A \u06A9\u0633\u0631 \u0627\u0632 \u062D\u0633\u0627\u0628 \u0628\u0647 \u0627\u0632\u0627\u06CC \u0633\u0631\u0648\u06CC\u0633 \u0647\u0627\u06CC \u06A9\u0627\u0631\u062A \u0646\u0627\u0645\u0648\u0641\u0642 \u0628\u0648\u062F\u0647 \u0627\u0633\u062A.
err.repetitive-transaction-rrn=\u0634\u0645\u0627\u0631\u0647 \u062A\u0631\u0627\u06A9\u0646\u0634 \u0628\u0647 \u0627\u0632\u0627\u06CC \u0633\u0631\u0648\u06CC\u0633 \u0647\u0627\u06CC \u06A9\u0627\u0631\u062A \u062A\u06A9\u0631\u0627\u0631\u06CC \u0627\u0633\u062A.
err.invalid-reference-number-and-amount=\u0634\u0645\u0627\u0631\u0647 \u062A\u0631\u0627\u06A9\u0646\u0634 \u0648 \u0645\u0628\u0644\u063A \u0628\u0647 \u0627\u0632\u0627\u06CC \u0633\u0631\u0648\u06CC\u0633 \u0647\u0627\u06CC \u06A9\u0627\u0631\u062A \u0645\u0639\u062A\u0628\u0631 \u0646\u0645\u06CC \u0628\u0627\u0634\u062F.
err.user-serial-is-not-valid=\u0634\u0645\u0627\u0631\u0647 \u0633\u0631\u06CC\u0627\u0644 \u06A9\u0627\u0631\u0628\u0631 \u0645\u0639\u062A\u0628\u0631 \u0646\u0645\u06CC \u0628\u0627\u0634\u062F.
err.start-and-end-time-is-not-valid=\u0632\u0645\u0627\u0646 \u0634\u0631\u0648\u0639 \u0648 \u067E\u0627\u06CC\u0627\u0646 \u0645\u0639\u062A\u0628\u0631 \u0646\u0645\u06CC \u0628\u0627\u0634\u062F.
err.random-ab-not-generated=\u0634\u0645\u0627\u0631\u0647 \u062A\u0635\u0627\u062F\u0641\u06CC \u062A\u0648\u0644\u06CC\u062F \u0646\u0634\u062F.
err.card-is-changed=\u062F\u0631 \u062D\u06CC\u0646 \u0639\u0645\u0644\u06CC\u0627\u062A \u06A9\u0627\u0631\u062A \u062A\u0639\u0648\u06CC\u0636 \u0634\u062F\u0647 \u0627\u0633\u062A.